"use client";

import { use } from "react";
import { useRouter } from "next/navigation";
import { useState } from "react";

type Props = {
  params: Promise<{
    id: string;
  }>;
};

export default function InstructionPage({
  params,
}: Props) {
  const { id } = use(params);

  const router = useRouter();

  const [accepted, setAccepted] = useState(false);

  return (
    <main className="min-h-screen bg-[#F8FAFC] flex justify-center py-10">
      <div className="bg-white w-full max-w-5xl rounded-xl shadow-lg border border-gray-200 p-10">

        <h1 className="text-4xl font-bold text-[#7A1F2B] mb-8">
          Інструкція щодо проходження тестування
        </h1>

        <div className="text-gray-700 leading-8 text-justify">

          <p className="text-center font-bold mb-6">
            Шановний учасник / учасниця тренувального тестування!
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            Обов’язково ознайомтеся з правилами проходження тестування та
            правилами роботи із сервісом і натисніть на кнопку
            «Ознайомлений / Ознайомлена з правилами проходження тестування».
            Наголошуємо, що в разі порушення цих правил вас буде позбавлено
            права продовжувати роботу, а ваші результати буде анульовано.
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            Зауважуємо: у ТЕЦ може бути здійснено контроль за дотриманням
            процедури проходження НМТ за допомогою металодетектора. Також у
            ТЕЦ здійснюється відеоспостереження.
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            Якщо ви забули вимкнути мобільні телефони чи залишити їх або
            зарядні пристрої, смартгодинники, навушники в спеціально
            відведеному місці — пропонуємо зробити це зараз. У разі
            виникнення технічних збоїв у роботі сервісу або погіршення
            самопочуття потрібно негайно повідомити про це інструктора.
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            Якщо ви вважатимете, що щодо вас допущено порушення процедури
            проведення НМТ, що може вплинути на ваш результат, — до виходу
            з тимчасового екзаменаційного центру (ТЕЦ) подайте відповідальному
            за ТЕЦ апеляційну заяву щодо порушення процедури. Зауважте, що
            подати таку заяву після виходу з ТЕЦ не можна.
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            У випадку оголошення повітряної тривоги до початку допуску до ТЕЦ
            пройдіть в укриття за вказівниками та перебувайте там до
            повідомлення про її завершення. Якщо ж повітряну тривогу
            оголосять під час тестування — вас буде повідомлено про це,
            а роботу над тестом заблоковано. У такому разі ви маєте чітко
            дотримуватися вказівок старшого інструктора.
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            Якщо ви не зможете завершити виконання роботи через виникнення
            нестандартних ситуацій у ТЕЦ або через різке погіршення стану
            здоров’я, вам буде надано змогу пройти НМТ під час додаткових
            сесій, але за умови, якщо в установлені терміни подасте заяву
            щодо участі в додаткових сесіях.
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            На виконання завдань з української мови відведено 60 хвилин.
            Для зарахування відповіді на завдання обов’язково потрібно
            натиснути на кнопку «Зберегти відповідь», а для її зміни чи
            виправлення — вибрати інший варіант і повторно натиснути на
            кнопку «Зберегти відповідь».
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            На боковій панелі, розташованій праворуч, відображатиметься
            інформація про опрацювання вами завдань. Червоним буде забарвлено
            номер завдання зі збереженою відповіддю, а сірим — завдання,
            яке ще не виконане або відповідь на яке не збережено. Тож за
            допомогою цієї панелі ви зможете контролювати свою роботу і
            швидко переходити до конкретного завдання в межах предмета,
            аби зберегти відповідь.
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            Стежте за вказівками, які з’являються на моніторі комп’ютера,
            а також читайте інформацію у спливних повідомленнях і про
            кількість опрацьованих вами завдань із кожного предмета.
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            Якщо ви дочасно закінчите роботу над завданнями — можете
            завершити відповідний етап тестування, натиснувши на кнопку
            «Завершити роботу над тестом».
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            Будьте уважні: на екрані з’явиться напис з інформацією про те,
            на які завдання ви не надали та/або не зберегли відповідей.
            Повернутися до виконання завдань й надати та зберегти відповіді
            можна протягом усього часу, відведеного на виконання завдань.
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            Пам’ятайте: після повторного натискання на кнопку
            «Так, завершити роботу» повернутися до виконання завдань і
            зміни відповідей буде неможливо. Стежте за вказівками, які
            з’являються на моніторі комп’ютера. Підтверджуйте своє рішення,
            якщо дійсно бажаєте завершити роботу.
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            Після завершення виконання завдань тестування на екрані монітора
            відобразиться інформація про збережені вами відповіді і набрані
            вами тестові бали з кожного навчального предмета обох етапів.
          </p>

          <p className="text-indent-[0.6mm] mb-4">
            Якщо вам потрібна допомога у вирішенні питань, які не стосуються
            змісту завдань тесту, піднесіть руку, і до вас підійде старший
            інструктор.
          </p>

          <p className="text-indent-[0.6mm] mb-8">
            Перевірте, чи зручно для комфортного користування розташований
            персональний комп’ютер на вашому робочому місці.
          </p>

          <p className="text-center font-bold mb-8">
            Зичимо успіхів!
          </p>

        </div>

        <div className="mt-10 flex items-center gap-4">

          <input
            id="agree"
            type="checkbox"
            checked={accepted}
            onChange={(e) => setAccepted(e.target.checked)}
            className="w-5 h-5"
          />

          <label
            htmlFor="agree"
            className="text-lg"
          >
            Ознайомлений / Ознайомлена з правилами проходження тестування
          </label>

        </div>

        <div className="mt-10 flex justify-end">

          <button
            disabled={!accepted}
            onClick={async () => {
              try {
                await document.documentElement.requestFullscreen();

                router.push(`/test/${id}`);
              } catch {
                alert(
                  "Для проходження тесту необхідно дозволити повноекранний режим."
                );
              }
            }}
            className="
              px-8
              py-4
              rounded-xl
              text-white
              font-semibold
              transition
              disabled:bg-gray-400
              bg-[#7A1F2B]
              hover:bg-[#641823]
            "
          >
            Розпочати тестування
          </button>

        </div>

      </div>
    </main>
  );
}